--====== 250305_DQL(SELECT)_복습용계정(TEST250305).sql 실행 후 아래 조회 ======--
-- 사용자 계정을 접속해주세요. (사용자명: C##TEST250305 / 비밀번호: test0305)
-- 모든 사람의 정보 조회

-- 이름, 생년월일, 나이 정보 조회

-- 나이가 40대인 사람들의 정보 조회

-- 광역시에 거주 중인 사람들의 정보 조회

-- 이름이 2자인 사람들의 정보 조회

--===========================================================================
-- '250305' 문자타입 데이터를 '2025년 03월 05일'로 표현

-- 본인이 태어난지 며칠 째인지 확인

--===========================================================================
-- 사용자 계정을 접속해주세요. (사용자명: C##KH / 비밀번호: KH)
--  해당 계정이 없을 경우 추가 후 kh.sql 스크립트 실행하여 아래 내용을 수행해주세요.

-- 퇴사하지 않은 사원의 급여 합 조회

-- 입사월별 사원 수 조회 (* 입사월 오름차순 정렬)