/*
    아래 쿼리문의 실행 순서는?
    
    SELECT 컬럼명                            -- 1
    FROM 테이블명                            -- 2
    WHERE 조건                               -- 3
    GROUP BY 그룹화기준                       -- 4
    HAVING 그룹 조건                          -- 5
    ORDER BY 정렬 기준                        -- 6
*/

--=========================================================================
--     수업용 계정 로그인 후 아래 정보를 조회할 수 있는 쿼리문을 작성해주세요
--=========================================================================
-- 이메일의 아이디 부분에(@ 앞부분) k가 포함된 사원 정보 조회

-- 연락처 앞자리가 010, 011로 시작하는 사원 수 조회

-- 생일이 7월이후인 사원들의 입사월별 사원 수 조회 (아래와 같이 출력)
/*
------------------------------------------------------------
    생월     |   입사월   |   입사 사원수|
         7월 |       4월 |          2명|
         7월 |       9월 |          1명|
         ...
         9월 |       6월 |          1명|
------------------------------------------------------------
*/

-- 영업부서 사원의 사번, 사원명, 부서명, 직급명 조회
-- ** 오라클 구문 **

-- ** ANSI 구문 **


-- 사수가 없는 사원 정보 조회 (부서명, 사번, 사원명 조회)
-- ** 오라클 구문 **

-- ** ANSI 구문 **

-- 부서별 사수가 없는 사원 수 조회 (부서명, 사원수 조회)
-- ** 오라클 구문 **

-- ** ANSI 구문 **